# ReportingParamAlreadyLabelsToAnotherDim Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..ReportingParamAlreadyLabelsToAnotherDim Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Cannot label multi-dimensions to one reporting parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ReportingParamAlreadyLabelsToAnotherDim { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ReportingParamAlreadyLabelsToAnotherDim As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ReportingParamAlreadyLabelsToAnotherDim {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace